ahtn/keyplus/ports/efm8/efm8/mcu/EFM8BB3/peripheral_driver/inc/clu_3.h
/******************************************************************************
 * Copyright (c) 2014 by Silicon Laboratories Inc. All rights reserved.
 *
 * http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
 *****************************************************************************/

#ifndef __CLU_3_H__
#define __CLU_3_H__

#include "efm8_config.h"
#include "SI_EFM8BB3_Register_Enums.h"

/**************************************************************************//**
 * @addtogroup clu_3 CLU3 Driver
 * @{
 *
 * @brief Peripheral driver for CLU3
 *
 * ## Introduction ##
 * The configurable logic (CL) module provides multiple blocks of 
 * user-programmed digital logic that operates without CPU intervention. It
 * consists of four dedicated independent configurable logic units (CLUs) which
 * support user programmable asynchronous and synchronous boolean logic 
 * operations. A number of internal and external signals may be used as inputs
 * to each CLU, and the outputs may be routed out to port I/O pins or directly
 * to select peripheral inputs.
 *
 * This peripheral driver allows for the configuration and runtime operation of
 * one of the four Configurable Logic Units, CLU3.
 *
 * ## Memory Usage ##
 *
 * The following table shows the approximate amount of memory used by this
 * module with various features enabled.  Typically, only a portion of the
 * module's API is used, so actual memory usage is expected to be less.
 *
 * |Config        |Macro                     | CODE | XDATA | IDATA | DATA |
 * |--------------|--------------------------|------|-------|-------|------|
 * |Base          |                          |  115 |     0 |     0 |   3  |
 * |Auto-page     |EFM8PDL_CLU3_AUTO_PAGE    |  +77 |    +0 |    +0 |  +0  |
 * |Use ISR       |EFM8PDL_CLU3_USE_ISR      |  +91 |    +0 |    +0 |  +1  |
 * |Default       |                          |  192 |     0 |     0 |   3  |
 *
 * ## Configuring the CLU ##
 * The CLU has three inputs, two of which are configurable: Input A and Input B.
 * Input C is always the output of the previous CLU or, in the case of the first
 * CLU, the output of the last CLU.
 *
 * Additionally, the CLU output can be routed either directly from the CLU's
 * Look-Up Table (LUT), or synchronized through a D Flip-Flop. The CLU
 * initialization function, CLU3_init(), allows for the configuration of
 * these options.
 *
 * ~~~~~.c
 * // Configure the CLU inputs as CLU1 output, PCA channel CEX0, and have the
 * // output be sourced directly from the LUT.
 * CLU3_init(CLU3_INPUT_A_CLU1_OUT, CLU3_INPUT_A_CEX0, CLU3_OUTPUT_MODE_LUT);
 *
 * // Configure the CLU inputs as P0.0 and P0.1, with the output synchronized
 * CLU3_init(CLU3_INPUT_A_P0_0, CLU3_INPUT_B_P0_1, CLU_OUTPUT_MODE_FLIPFLOP);
 * ~~~~~
 *
 * If using the Flip-Flop output, the function CLU3_initFlipflop() allows for
 * some additional configuration options: the clock which will clock the
 * Flip-flop, as well as whether the Flip-flop's output will be inverted.
 *
 * ~~~~~.c
 *  // Initialize the flip-flop to be clocked by SYSCLK, output not inverted
 *  CLU3_initFlipflop(CLU3_FLIPFLOP_CLOCK_SYSCLK, false);
 * ~~~~~
 *
 * ## Configuring the Output Function ##
 * The output of the CLU can be any boolean expression containing any
 * of the inputs. The @ref clu3_func "Output Function Macros" provide a
 * simplified way of generating the correct output function, while the
 * function CLU3_setOutputFunction() will take this function and apply
 * it to the CLU.
 *
 * ~~~~~.c
 * // Set the CLU output to equal A NOR B.
 * CLU3_setOutputFunction(CLU3_FUNCTION_NOR(CLU3_INPUT_A, CLU3_INPUT_B));
 * ~~~~~
 *
 * The CLU Output can also be set directly using the CLU3_Input_t input enums
 * with the corresponding bitwise (instead of logical) operators for the
 * desired output.
 *
 * ~~~~~.c
 * // Set the CLU output to equal A AND B.
 * CLU3_setOutputFunction(CLU3_INPUT_A & CLU3_INPUT_B);
 *
 * // Set the CLU output to equal (A OR B) XOR NOT C.
 * CLU3_setOutputFunction((CLU3_INPUT_A | CLU3_INPUT_B) ^ ~CLU3_INPUT_C);
 * ~~~~~
 * 
 * ## Utilizing the Output ##
 * The CLU's output can be used in many ways: it can be consumed by many other
 * peripherals, output to a pin (enabled by CLU3_enablePinOutput()), or used
 * to trigger an interrupt on a rising or falling edge. Additionally, the 
 * output value can be obtained directly using the CLU3_getOutput() function.
 *
 * Rising and Falling interrupts can be enabled by passing the appropriate flag
 * to the CLU3_enableInt() function. If **EFM8PDL_CLU3_USE_ISR** is defined as 1
 * within **efm8_config.h**, interrupts will be handled by the driver, calling the
 * respective callback ,CLU3_fallingEdgeCb() or CLU3_risingEdgeCb(), on a
 * falling edge or rising edge event.
 *
 * @note CLU3_enableInt() does not enable the combined CL interrupt or global
 * interrupts. These must be enabled manually.
 *
 * ## Example ##
 * This example uses the CLU to OR together the A and B inputs, P0.2 and
 * P0.3. The rising edge of the CLU output is then used to trigger an
 * interrupt, which turns on an LED. The falling edge is used to trigger
 * an interrupt to turn the LED off.
 *
 * ~~~~~.c
 * void main (void)
 * {
 *    // Enable global Configurable Logic interrupts
 *    // as well as global interrupt enable in Configurator
 *    enter_DefaultMode_from_RESET();
 * 
 *    // Init CLU3 with P0.2 as Input A, P0.3 as Input B. Output from Flip-Flop
 *    CLU3_init(CLU3_INPUT_A_P0_2, CLU3_INPUT_B_P0_3, CLU3_OUTPUT_MODE_FLIPFLOP);
 * 
 *    // Initialize the flip-flop to be clocked by SYSCLK
 *    CLU3_initFlipflop(CLU3_FLIPFLOP_CLOCK_SYSCLK, false);
 * 
 *    // Set output function to A OR B
 *    CLU3_setOutputFunction(CLU3_INPUT_A | CLU3_INPUT_B);
 * 
 *    // Enable CLU3 Rising-edge and Falling-edge interrupts.
 *    CLU3_enableInt(CLU3_RISING_EDGE_IF | CLU3_FALLING_EDGE_IF, true);
 * 
 *    while (1) {}
 * }
 * 
 * SI_SBIT(LED0, SFR_P1, 4);
 * #define LED_ON  0
 * #define LED_OFF 1
 *
 * void CLU3_fallingEdgeCb()
 * {
 *   LED0 = LED_OFF;
 * }
 * 
 * void CLU3_risingEdgeCb()
 * {
 *   LED0 = LED_ON;
 * }
 * ~~~~~
 *
 *
 *****************************************************************************/

 //Option macro documentation
/**************************************************************************//**
 * @addtogroup clu3_config Driver Configuration
 * @{
 *
 *  @brief
 *    Driver configuration constants read from efm8_config.h
 *
 *  This peripheral driver will look for configuration constants in
 *  **efm8_config.h**. This file is provided/written by the user and should be
 *  located in a directory that is part of the include path.
 *
 ******************************************************************************/

/**************************************************************************//**
 * @def EFM8PDL_CLU3_AUTO_PAGE
 * @brief Controls if the library handles SI_SFR paging.
 *
 * When '1' the CLU3 driver automatically handles setting and restoring
 * SI_SFR page for each call. When disabled the library consumes less code
 * space but the user must ensure that the correct page is set when calling
 * driver functions that access hardware.
 *
 * Default setting is '1' and may be overridden by defining in 'efm8_config.h'.
 *
 *****************************************************************************/

 /**************************************************************************//**
 * @def EFM8PDL_CLU3_USE_ISR
 * @brief Controls inclusion of CLU3 ISR and associated callbacks.
 *
 * When '1' the CL0 ISR in the driver is used and callbacks are functional.
 *
 * Default setting is '0' and may be overridden by defining in 'efm8_config.h'.
 *
 *****************************************************************************/
/**  @} (end addtogroup clu3_config Driver Configuration) */

#ifndef IS_DOXYGEN
  #define IS_DOXYGEN 0
#endif

#ifndef EFM8PDL_CLU3_AUTO_PAGE
 #define EFM8PDL_CLU3_AUTO_PAGE 1
#endif

#ifndef EFM8PDL_CLU3_USE_ISR
 #define EFM8PDL_CLU3_USE_ISR 0
#endif

// Initialization API
/**************************************************************************//**
 * @addtogroup clu3_init CLU3 Initialization API
 * @{
 *****************************************************************************/
typedef enum {
  CLU3_INPUT_A_CLU0_OUT = CLU3MX_MXA__CLU3A0,  //!< CLU Input A is the CLU3 output.
  CLU3_INPUT_A_CLU1_OUT = CLU3MX_MXA__CLU3A1,  //!< CLU Input A is the CLU1 output.
  CLU3_INPUT_A_CLU2_OUT = CLU3MX_MXA__CLU3A2,  //!< CLU Input A is the CLU2 output.
  CLU3_INPUT_A_CLU3_OUT = CLU3MX_MXA__CLU3A3,  //!< CLU Input A is the CLU3 output.
  CLU3_INPUT_A_TIMER5 = CLU3MX_MXA__CLU3A4,    //!< CLU Input A is Timer5 overflow.
  CLU3_INPUT_A_CEX2 = CLU3MX_MXA__CLU3A5,      //!< CLU Input A is PCA CEX2.
  CLU3_INPUT_A_CEX4 = CLU3MX_MXA__CLU3A6,      //!< CLU Input A is PCA CEX4.
  CLU3_INPUT_A_CEX5 = CLU3MX_MXA__CLU3A7,      //!< CLU Input A is PCA CEX5.
  CLU3_INPUT_A_P0_2 = CLU3MX_MXA__CLU3A8,      //!< CLU Input A is pin P0.2.
  CLU3_INPUT_A_P0_3 = CLU3MX_MXA__CLU3A9,      //!< CLU Input A is pin P0.3.
  CLU3_INPUT_A_P0_6 = CLU3MX_MXA__CLU3A10,      //!< CLU Input A is pin P0.6.
  CLU3_INPUT_A_P0_7 = CLU3MX_MXA__CLU3A11,      //!< CLU Input A is pin P0.7.
  CLU3_INPUT_A_P1_2 = CLU3MX_MXA__CLU3A12,      //!< CLU Input A is pin P1.2.
  CLU3_INPUT_A_P1_3 = CLU3MX_MXA__CLU3A13,      //!< CLU Input A is pin P1.3.
  CLU3_INPUT_A_P2_2 = CLU3MX_MXA__CLU3A14,      //!< CLU Input A is pin P2.2.
  CLU3_INPUT_A_P2_3 = CLU3MX_MXA__CLU3A15,      //!< CLU Input A is pin P2.3.
}CLU3_InputA_t;
