ahtn/keyplus/ports/efm8/efm8/mcu/EFM8BB3/peripheral_driver/inc/clu_3.h
/// @brief CLU Input B enums.
typedef enum {
  CLU3_INPUT_B_CLU0_OUT = CLU3MX_MXB__CLU3B0,  //!< CLU Input B is the CLU3 output.
  CLU3_INPUT_B_CLU1_OUT = CLU3MX_MXB__CLU3B1,  //!< CLU Input B is the CLU1 output.
  CLU3_INPUT_B_CLU2_OUT = CLU3MX_MXB__CLU3B2,  //!< CLU Input B is the CLU2 output.
  CLU3_INPUT_B_CLU3_OUT = CLU3MX_MXB__CLU3B3,  //!< CLU Input B is the CLU3 output.
  CLU3_INPUT_B_ADBUSY = CLU3MX_MXB__CLU3B4,    //!< CLU Input B is the ADC's ADBUSY flag.
  CLU3_INPUT_B_CEX0 = CLU3MX_MXB__CLU3B5,      //!< CLU Input B is PCA CEX0.
  CLU3_INPUT_B_CEX1 = CLU3MX_MXB__CLU3B6,      //!< CLU Input B is PCA CEX1.
  CLU3_INPUT_B_CEX3 = CLU3MX_MXB__CLU3B7,      //!< CLU Input B is PCA CEX3.
  CLU3_INPUT_B_P0_0 = CLU3MX_MXB__CLU3B8,      //!< CLU Input B is pin P0.0.
  CLU3_INPUT_B_P0_1 = CLU3MX_MXB__CLU3B9,      //!< CLU Input B is pin P0.1.
  CLU3_INPUT_B_P0_4 = CLU3MX_MXB__CLU3B10,      //!< CLU Input B is pin P0.4.
  CLU3_INPUT_B_P0_5 = CLU3MX_MXB__CLU3B11,      //!< CLU Input B is pin P0.5.
  CLU3_INPUT_B_P1_0 = CLU3MX_MXB__CLU3B12,      //!< CLU Input B is pin P1.0.
  CLU3_INPUT_B_P1_1 = CLU3MX_MXB__CLU3B13,      //!< CLU Input B is pin P1.1.
  CLU3_INPUT_B_P2_0 = CLU3MX_MXB__CLU3B14,      //!< CLU Input B is pin P2.0.
  CLU3_INPUT_B_P2_1 = CLU3MX_MXB__CLU3B15,      //!< CLU Input B is pin P2.1.
}CLU3_InputB_t;

/// @brief CLU Input C enums.
typedef enum {
  CLU3_INPUT_C_CLU3_OUT,    //!< CLU Input C is the CLU3 output.
}CLU3_InputC_t;

/// @brief CLU Output mode enums.
typedef enum {
  CLU3_OUTPUT_MODE_LUT = CLU3CF_OUTSEL__LUT,      //!< CLU Output is directly from the LUT.
  CLU3_OUTPUT_MODE_FLIPFLOP = CLU3CF_OUTSEL__D_FF, //!< CLU Output passes through a D Flip-flop.
}CLU3_OutputMode_t;

/***************************************************************************//**
* @brief
* Initialize the CLU.
*
* @param inputA:
* The A input to the CLU.
* @param inputB:
* The B input to the CLU.
* @param mode:
* The output mode of the CLU - direct from the LUT or through a D flip-flop.
*
* This is a basic initialization function that configures the CLU inputs and
* output mode, then enables the CLU.
*
* The CLU's output function is not initialized, and must be changed with
* CLU3_setOutputFunction().
*
* The initialization API provides only the most basic and common configuration
* options. To access more advanced options, or to generate more efficient
* initialization code, please use the Hardware Configuration tool.
*
******************************************************************************/

// Three functions, instead?
//void CLU3_setInputA(CLU3_InputA_t input);
//void CLU3_setInputB(CLU3_InputB_t input);
//void CLU3_setOutputMode(CLU3_OutputMode_t mode);

void CLU3_init(CLU3_InputA_t inputA,
               CLU3_InputB_t inputB,
               CLU3_OutputMode_t mode);

/// @brief D Flip-flop clocking enums.
typedef enum {
  CLU3_FLIPFLOP_CLOCK_CARRY_IN = CLU3CF_CLKSEL__CARRY_IN,       //!< The D Flip-flop clock is the Carry-in (Input C).
  CLU3_FLIPFLOP_CLOCK_A_INPUT = CLU3CF_CLKSEL__MXA_INPUT,        //!< The D Flip-flop clock is Input A.
  CLU3_FLIPFLOP_CLOCK_SYSCLK = CLU3CF_CLKSEL__SYSCLK,         //!< The D Flip-flop clock is Sysclk.
  CLU3_FLIPFLOP_CLOCK_TIMER1 = CLU3CF_CLKSEL__ALTCLK,         //!< The D Flip-flop clock is Timer 1 overflow.
}CLU3_FlipflopClock_t;
/***************************************************************************//**
* @brief
* Initialize the CLU's D Flip-flop.
*
* @param clock:
* The flip-flop clock.
* @param clockInvert:
* Sets whether the clock is inverted.
*
* This is a basic initialization function that configures the CLU's D flip-flop.
*
* @note If the CLU is configured to output directly from its LUT, these settings
* will have no effect.
*
******************************************************************************/
void CLU3_initFlipflop(CLU3_FlipflopClock_t clock, bool clockInvert);


/// @brief Input Enums to be passed to the Output Function Macros.
typedef enum {
  CLU3_INPUT_A = 0xF0, //!< CLU3 Input A
  CLU3_INPUT_B = 0xCC, //!< CLU3 Input B
  CLU3_INPUT_C = 0xAA, //!< CLU3 Input C
}CLU3_Input_t;

typedef uint8_t CLU3_Function_t;
/**************************************************************************//**
* @addtogroup clu3_func Output Function Macros
*
* These macros take CLU inputs of type CLU3_Input_t and generate the appropriate
* function of type CLU3_Function_t for CLU3_setOutputFunction(). These macros
* can be nested for more advanced logical functions.
*
* @note These functions are implemented as macros.
* @{
******************************************************************************/
#if IS_DOXYGEN
/// @brief Returns the logical NOT output function for the given input.
CLU3_Function_t CLU3_FUNCTION_NOT(CLU3_Input_t x);
/// @brief Returns the logical AND output function for the given inputs.
CLU3_Function_t CLU3_FUNCTION_AND(CLU3_Input_t x, CLU3_Input_t y);
/// @brief Returns the logical OR output function for the given inputs.
CLU3_Function_t CLU3_FUNCTION_OR(CLU3_Input_t x, CLU3_Input_t y);
/// @brief Returns the logical NOR output function for the given inputs.
CLU3_Function_t CLU3_FUNCTION_NOR(CLU3_Input_t x, CLU3_Input_t y);
/// @brief Returns the logical NAND output function for the given inputs.
CLU3_Function_t CLU3_FUNCTION_NAND(CLU3_Input_t x, CLU3_Input_t y);
/// @brief Returns the logical XOR output function for the given inputs.
CLU3_Function_t CLU3_FUNCTION_XOR(CLU3_Input_t x, CLU3_Input_t y);
/// @brief Returns the logical XNOR output function for the given inputs.
CLU3_Function_t CLU3_FUNCTION_XNOR(CLU3_Input_t x, CLU3_Input_t y);
/***************************************************************************//**
 * @brief
 * Returns an output function that outputs one of two given inputs based on a select input.
 *
 * @param x:
 * The input selected when **sel** is high.
 * @param y:
 * The input selected when **sel** is low.
 * @param sel:
 * The input that selects between **x** and **y** inputs.
 *
 ******************************************************************************/
CLU3_Function_t CLU3_FUNCTION_SELECT(CLU3_Input_t x, CLU3_Input_t y, CLU3_Input_t sel);
#else
#define CLU3_FUNCTION_NOT(CLU3_Input_x)                 ~(CLU3_Input_x)
#define CLU3_FUNCTION_AND(CLU3_Input_x, CLU3_Input_y)    ((CLU3_Input_x)&(CLU3_Input_y))
#define CLU3_FUNCTION_OR(CLU3_Input_x, CLU3_Input_y)     ((CLU3_Input_x)|(CLU3_Input_y))
#define CLU3_FUNCTION_NOR(CLU3_Input_x, CLU3_Input_y)    ~(CLU3_FUNCTION_OR(CLU3_Input_x,CLU3_Input_y))
#define CLU3_FUNCTION_NAND(CLU3_Input_x, CLU3_Input_y)   ~(CLU3_FUNCTION_AND(CLU3_Input_x,CLU3_Input_y))
#define CLU3_FUNCTION_XOR(CLU3_Input_x, CLU3_Input_y)    (CLU3_FUNCTION_AND(CLU3_FUNCTION_OR(CLU3_Input_x,CLU3_Input_y),~CLU3_FUNCTION_AND(CLU3_Input_x,CLU3_Input_y)))
#define CLU3_FUNCTION_XNOR(CLU3_Input_x, CLU3_Input_y)   ~(CLU3_FUNCTION_XOR(CLU3_Input_x,CLU3_Input_y))
#define CLU3_FUNCTION_SELECT(CLU3_Input_x, CLU3_Input_y, CLU3_Input_sel)     (CLU3_FUNCTION_OR(CLU3_FUNCTION_AND(CLU3_Input_x,CLU3_Input_sel),CLU3_FUNCTION_AND(CLU3_Input_y,~(CLU3_Input_sel))))
#endif
/** @} (end addtogroup clu3_func Output Function Macros) */

/***************************************************************************//**
 * @brief
 * Sets the output function of the CLU's LUT
 *
 * @param function:
 * The desired output function.
 *
 * This function determines the output of the CLU based on the inputs. Valid
 * inputs include any of the @ref clu3_func "Output Function Macros", or any custom 8-bit
 * function output. The bits of the variable **function** correspond to
 * the CLU's LUT output. The truth-table for this output is as follows:
 *
 * | A input | B input | C input | LUT Output  |
 * |---------|---------|---------|-------------|
 * |    0    |    0    |    0    |  function.0 |
 * |    0    |    0    |    1    |  function.1 |
 * |    0    |    1    |    0    |  function.2 |
 * |    0    |    1    |    1    |  function.3 |
 * |    1    |    0    |    0    |  function.4 |
 * |    1    |    0    |    1    |  function.5 |
 * |    1    |    1    |    0    |  function.6 |
 * |    1    |    1    |    1    |  function.7 |
 *
 ******************************************************************************/
void CLU3_setOutputFunction(CLU3_Function_t function);
/** @} (end clu3_init CLU3 Initialization API) */

// Runtime API
/**************************************************************************//**
 * @addtogroup clu3_runtime CLU3 Runtime API
 * @{
 *****************************************************************************/
 /**************************************************************************//**
 * @addtogroup clu3_if Interrupt Flag Enums
 * @{
 ******************************************************************************/
#define CLU3_FALLING_EDGE_IF  CLIF0_C3FIF__BMASK    //!<  Rising Edge flag
#define CLU3_RISING_EDGE_IF CLIF0_C3RIF__BMASK //!<  Falling Edge flag

