ahtn/keyplus/ports/efm8/efm8/mcu/EFM8BB3/peripheral_driver/inc/clu_3.h
/** @} (end addtogroup clu3_if Interrupt Flag Enums) */
/***************************************************************************//**
 * @brief
 * Return the value of the interrupt flags
 *
 * @return
 * The state of the Interrupt flags. This value is the logical OR of any of the
 * following  flags found within @ref clu3_if "Interrupt Flag Enums":
 *  - \b CLU3_FALLING_EDGE_IF - Interrupt flag set when the output of the CLU
 *    changes from high to low.
 *  - \b CLU3_RISING_EDGE_IF - Interrupt flag set when the output of the CLU
 *    changes from low to high.
 *
 ******************************************************************************/
uint8_t CLU3_getIntFlags(void);

/***************************************************************************//**
 * @brief
 * Clear the specified interrupt flags.
 *
 * @param flags:
 * A bit mask of interrupt flags to be cleared. This value is the logical OR
 * of any of the following flags found within @ref clu3_if "Interrupt Flag Enums":
 *  - \b CLU3_FALLING_EDGE_IF - Interrupt flag set when the output of the CLU
 *    changes from high to low.
 *  - \b CLU3_RISING_EDGE_IF - Interrupt flag set when the output of the CLU
 *    changes from low to high.
 *
 ******************************************************************************/
void CLU3_clearIntFlags(uint8_t flags);

/***************************************************************************//**
 * @brief
 * Enable or disable the CLU interrupts
 *
 * @param flags:
 * A bit mask of interrupts to be enabled or disabled. This value is the logical OR
 * of any of the following flags found within @ref clu3_if "Interrupt Flag Enums":
 *  - \b CLU3_FALLING_EDGE_IF - Interrupt flag set when the output of the CLU
 *    changes from high to low.
 *  - \b CLU3_RISING_EDGE_IF - Interrupt flag set when the output of the CLU
 *    changes from low to high.
 *
 * @param enable:
 * New interrupt status (**true** to enable, **false** to disable)
 *
 ******************************************************************************/
void CLU3_enableInt(uint8_t flags, bool enable);

/***************************************************************************//**
* @brief
* Enable the CLU
*
* The CLU will be enabled, allowing the CLU output to change based on the
* CLU inputs.
*
******************************************************************************/
void CLU3_enable(void);

/***************************************************************************//**
* @brief
* Disable the CLU
*
* The CLU will be disabled. The CLU output will be set to zero.
*
******************************************************************************/
void CLU3_disable(void);

/***************************************************************************//**
* @brief
* Enable the CLU output pin.
*
* The CLU's output pin will be enabled and will be driven to the logic level
* of the CLU output.
*
******************************************************************************/
void CLU3_enablePinOutput(void);

/***************************************************************************//**
* @brief
* Disable the CLU output pin.
*
* The CLU's output pin will be disabled.
*
******************************************************************************/
void CLU3_disablePinOutput(void);

/***************************************************************************//**
* @brief
* Get the current CLU output value
*
* @return The value of the CLU output, *true* or *false*.
*
******************************************************************************/
bool CLU3_getOutput(void);

/** @} (end clu3_runtime CLU3 Runtime API) */
//=========================================================
// ISR API
//=========================================================
#if (EFM8PDL_CLU3_USE_ISR == 1) || IS_DOXYGEN
/**************************************************************************//**
 * @def void CLU3_ISR()
 * @brief CLU Interrupt handler (not a callback).
 *
 * This ISR is provided by the library when EFM8PDL_CLU3_USE_ISR = "1".
 *
 *****************************************************************************/
#endif //EFM8PDL_CLU3_USE_ISR

// Callbacks
/**************************************************************************//**
 * @addtogroup clu3_callback User Callbacks
 * @{
 *****************************************************************************/
#if (EFM8PDL_CLU3_USE_ISR == 1) || IS_DOXYGEN

/***************************************************************************//**
 * @addtogroup clu3_callbacks_isr ISR API
 * @{
 *
 * These callbacks will be called by the library when
 * EFM8PDL_CLU3_USE_ISR. If the ISR Api is disabled
 * the callbacks do not need to be provided by the user.
 *
 ******************************************************************************/

/***************************************************************************//**
 * @brief
 * Callback for CLU Falling Edge interrupt.
 *
 * This function is defined by the user and called by the peripheral driver when
 * the CLU output transitions from high to low.
 *
 * @warning
 * This function is called from an ISR and should be as short as possible.
 *
 ******************************************************************************/
extern void CLU3_fallingEdgeCb();

/***************************************************************************//**
 * @brief
 * Callback for CLU Rising Edge interrupt.
 *
 * This function is defined by the user and called by the peripheral driver when
 * the CLU output transitions from low to high.
 *
 * @warning
 * This function is called from an ISR and should be as short as possible.
 *
 ******************************************************************************/
extern void CLU3_risingEdgeCb();

#endif //EFM8PDL_CLU3_USE_ISR
/**  @} (end addtogroup clu3_callbacks_isr ISR API) */
/**  @} (end addtogroup clu3_callback User Callbacks) */

/** @} (end addtogroup clu_3 CLU3 Driver) */

#endif //__CLU_3_H__
